In [1]:
import pandas as pd
#Create a Dictionary of series
d = {'Name':pd.Series(['Raj','Sham','Tusar','Ram','Jaggu','Karishma','Pranab',
'Shami','Chahal','Dhoni','Sachin','Bumrah']),
'Age':pd.Series([21,22,24,28,19,18,20,32,32,35,42,29]),
'Rating':pd.Series([4.17,3.89,3.63,5.00,1.98,1.03,2.36,4.00,3.92,4.88,4.99,4.23])}

In [8]:
#Create a DataFrame
database = pd.DataFrame(d)
database

        Name  Age  Rating
0        Raj   21    4.17
1       Sham   22    3.89
2      Tusar   24    3.63
3        Ram   28    5.00
4      Jaggu   19    1.98
5   Karishma   18    1.03
6     Pranab   20    2.36
7      Shami   32    4.00
8     Chahal   32    3.92
9      Dhoni   35    4.88
10    Sachin   42    4.99
11    Bumrah   29    4.23

In [9]:
database.mean()

C:\Users\DELL\AppData\Local\Temp\ipykernel_19920\731099213.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  database.mean()

Age       26.833333
Rating     3.673333
dtype: float64

In [10]:
database.median()

C:\Users\DELL\AppData\Local\Temp\ipykernel_19920\4040823249.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  database.median()

Age       26.00
Rating     3.96
dtype: float64

In [ ]:
print("Mean Values in the Distribution")
print(database.mean())
print("*******************************")
print("Median Values in the Distribution")
print(database.median())

In [15]:
database.value_counts()

Name      Age  Rating
Bumrah    29   4.23      1
Chahal    32   3.92      1
Dhoni     35   4.88      1
Jaggu     19   1.98      1
Karishma  18   1.03      1
Pranab    20   2.36      1
Raj       21   4.17      1
Ram       28   5.00      1
Sachin    42   4.99      1
Sham      22   3.89      1
Shami     32   4.00      1
Tusar     24   3.63      1
dtype: int64